## Bibliotecas

In [1]:
import pandas as pd

## Criando Dataframes

In [2]:
df_1 = pd.DataFrame({"nome": ["Caio", "Rodrigo", "Evandro", "Rafael"],
                     "idade": [28, 45, 27, 16]})

In [3]:
df_1

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16

In [4]:
df_2 = pd.DataFrame({"nome": ["Caio", "Mariane", "Maria"],
                     "idade": [28, 29, 59]})

In [5]:
df_2

      nome  idade
0     Caio     28
1  Mariane     29
2    Maria     59

## CONCAT simulando SQL UNION ALL

In [10]:
df = pd.concat([df_1, df_2], ignore_index=True)

In [11]:
df

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
4     Caio     28
5  Mariane     29
6    Maria     59

In [8]:
df.reset_index(drop=True, inplace=True) # ou usar ignore_index=True dentro do CONCAT

In [9]:
df

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
4     Caio     28
5  Mariane     29
6    Maria     59

## CONCAT simulando SQL UNION

In [12]:
# JUNTANDO E IGNORANDO VALORES DUPLICADOS


DF = pd.concat([df_1, df_2]).drop_duplicates().reset_index(drop=True)

In [13]:
DF

      nome  idade
0     Caio     28
1  Rodrigo     45
2  Evandro     27
3   Rafael     16
4  Mariane     29
5    Maria     59